Repository: Sudip2708/poustovnik-rozbor
Catalog: flaskblog/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: ...and thank you Corey!
cs: ...a děkuji i tobě Corey!

source: This pages are based on a YouTube video tutorial by Corey Schafer. They are made in Flask and they are my first real project and also real proof of Corey great teaching skills.
cs: Tyto stránky jsou postavené na základě YouTube výukových videí od Corey Schafer. Jsou dělané ve Flasku a jsou mým prvním projektem, a zároveň i důkazem, jak moc dobrý je Corey Schafer učitel.

source: About me
cs: O mě

source: I am quite newbie in the programming world. I've been studying Python for about a year and a half, and recently I completed a three-month course on creating web applications. So I was looking for some project to combine and practice new skills and found this. And I was perfect.
cs: Jsem nováčkem ve světe programování. Pythonu se věnuji rok a půl a na konci srpna 2023, jsem dokončil tříměsíční kurz programátora webových aplikací od firmy IT Network. Poté jsem se začal rozhlížet po nějakém projektu, který by kombinoval nově nabité zkušenosti a s kterým bych se mohl následně presentovat při hledání práce. A našel jsem tohle :-)

source: Purpose of this page
cs: Co vše jsem se zde naučil?

source: The main purpose of this page is just to present my current level to a potential employer and apart the fact I learned a lot by doing them they don't have a deeper meaning.
cs: Největším přínosem, bylo propojení a procvičení všech tří hlavních aspektů, kterým jsem se do teď věnoval (Python, web a databáze) do jednoho seskupujícího celku (Flask). Seznámení se strukturou Flasku a poznání některých jeho komponent. A to vše příjemnou a zábavnou formou.

source: Anything here is free to use. And if you have some question about this page or you have a job offer don't hesitate to ask. My email is in linkedin profile :-)
cs: Cokoliv, co zde najdete je libovolně k dispozici a pokud byste měli nějaký dotaz, týkající se těchto stránek, nebo pracovní nabídku, email na mě najdete v LinkedIn profilu.

source: Wish you all Wonderful Life...
cs: Ještě jednou děkuji za návštěvu a přeji příjemný život...

source: Tutorial by Corey Schafer
cs: Výuková videa od Corey Schafer

source: link to Corey Schafer youtube tutorial
cs: odkaz na Corey Schafer youtube tutoriál

source: Full code description (Czech)
cs: Kód s podrobným rozborem

source: code analysis in Czech
cs: podrobný rozbor kódu pro plnné pochopení

source: Short code description (Czech)
cs: Kód - stručná verze

source: code analysis in Czech (short version)
cs: zkrácený předchozího kódu o podrobný rozpis

source: Code in readable form (English)
cs: Best practice

source: code in English transcribed into readable notation
cs: Kód přepsaný do lépe čitelného zápisu dodržující standard

source: My LinkedIn
cs: Můj LinkedIn

source: link to my LinkedIn
cs: odkaz na můj LinkedIn

source: Title
cs: Nadpis

source: Content
cs: Obsah

source: Post
cs: Uožit

source: Your post has been created!
cs: Váš příspěvek byl vytvořen!

source: New Post
cs: Nový příspěvek

source: Your post has been updated!
cs: Váš příspěvek byl aktualizován!

source: Update Post
cs: Upravit příspěvek

source: Your post has been deleted!
cs: Váš příspěvek byl smazán!

source: About this page
cs: O této stránce

source: First of all, thank you for visiting
cs: Nejprve mi dovolte poděkovat za návštěvu

source: Account Info
cs: Informace o uživateli

source: Close
cs: Zavřít

source: Translate
cs: Zobrazit překlad

source: Flask Blog
cs: Poustovníček

source: Home
cs: Domů

source: About
cs: O této stránce

source: Account
cs: Nastavení

source: Logout
cs: Odhlásit se

source: Login
cs: Přihlásit se

source: Register
cs: Registrovat

source: Log In
cs: Přihlásit se

source: Forgot Password?
cs: Zapomenuté heslo?

source: Need An Account?
cs: Potřebujete založit účet?

source: Sign Up Now
cs: Založit účet

source: Back to original
cs: Zobrazit originál

source: Update
cs: Upravit příspěvek

source: Delete
cs: Smazat

source: Back
cs: Zpět

source: Delete Post?
cs: Smazat příspěvek?

source: Join Today
cs: Vytvořit účet

source: Already Have An Account?
cs: Máte již účet?

source: Sign In
cs: Přihlásit se

source: Reset Password
cs: Změna hesla

source: Links
cs: Odkazy

source: Here are some links you might find useful
cs: Zde je pár odkazů, které by se mohli hodit

source: What you can do here?
cs: Co vše zde můžete dělat?

source: The changes I made
cs: Změny, které jsem provedl

source: A known issue
cs: Známá chyba

source: Our Sidebar
cs: Postranní panel

source: You can put any information here you'd like.
cs: Tento panel je nefunkční a slouží jen pro nastínění dalších možností :-)

source: Latest Posts
cs: Nové příspěvky

source: Announcements
cs: Oznámení

source: Calendars
cs: Kalendář

source: etc
cs: atd

source: Posts by
cs: Příspěvky od uživatele

source: You don't have permission to do that (403)
cs: Bohužel nemáte patřičné oprávnění (403)

source: Please check your account and try again
cs: rosím, ověřte si stav svého účtu a zkuste to znovu

source: Oops. Page Not Found (404)
cs: Stránka nenalezena (404)

source: That page does not exist. Please try a different location
cs: Stránka, na kterou se snažíte vstoupit, neexistuje. Prosím zkontrolujte svoje zadání

source: Something went wrong (500)
cs: Něco se pokazilo (500)

source: We're experiencing some trouble on our end. Please try again in the near future
cs: Potíže na naší straně. Omlouváme se. Zkuste to prosím později.

source: Username
cs: Uživatelské jméno

source: Password
cs: Heslo

source: Confirm Password
cs: Potvrdit heslo

source: Sign Up
cs: Vytvořit účet

source: That username is taken. Please choose a different one.
cs: ámi zadané uživatelské jméno je již zabráno. Prosím vyberte jiné

source: That email is taken. Please choose a different one.
cs: Vámi zadaný email má již existující účet. Prosím vyberte jiný, nebo přejděte do sekce přihlášení

source: Remember Me
cs: Zapamatovat si mě

source: Update Profile Picture
cs: Změna profilového obrázku:

source: Request Password Reset
cs: Žádost o zaslání hesla

source: There is no account with that email. You must register first.
cs: Pro vámi zadaný email, neexistuje účet. Prosím zkontrolujte zadání

source: Your account has been created! You are now able to log in
cs: áš účet je založen! Nyní se můžete přihlásit

source: Login Unsuccessful. Please check email and password
cs: Přihlášení proběhlo neúspěšně. Prosím zkontrolujte zadané údaje

source: Your account has been updated!
cs: Váš účet by aktualizován!

source: An email has been sent with instructions to reset your password.
cs: Na vámi zadaný email byla odeslaná zpráva s instrukcemi pro změnu hesla

source: That is an invalid or expired token
cs: oto je neplatný již neplatný odkaz. Prosím zažádejte o nový

source: Your password has been updated! You are now able to log in
cs: Vaše heslo bylo změněno. Nyní se můžete přihlásit

source: Password Reset Request
cs: Žádost o změnu hesla

source: To reset your password, visit the following link:
cs: Pokud si přejete změnit své heslo, přejděte na následující odkaz

source: If you did not make this request then simply ignore this email and no changes will be made.
cs: Pokud jste o změnu hesla nežádali, ignorujte tento email a žádná změna nebude provedena.
